In [18]:
import pandas as pd

In [19]:
# 2 main datatypes

series = pd.Series(['BMW', 'Toyota', 'Honda'])

In [20]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [21]:
# series is 1-dimensional

In [22]:
colors = pd.Series(['Red', 'Blue', 'White'])
colors

0      Red
1     Blue
2    White
dtype: object

In [23]:
# Datafram = 2-dimensional
car_data = pd.DataFrame({'Car make:': series, 'Colour': colors})
car_data

  Car make: Colour
0       BMW    Red
1    Toyota   Blue
2     Honda  White

In [24]:
# Import data
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [25]:
# Exporting a dataframe
car_sales.to_csv("export_temp.csv")

In [26]:
exported_car_sales = pd.read_csv("export_temp.csv")
exported_car_sales

# We can see the new index populated. Lets fix it.

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [27]:
car_sales.to_csv("export_temp_index_off.csv", index=False)

In [28]:
exported_car_sales = pd.read_csv("export_temp_index_off.csv")
exported_car_sales
# Now the data is correct.

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [29]:
## Exporting data from URL
data_from_url = pd.read_csv("https://www.stats.govt.nz/assets/Uploads/Business-operations-survey/Business-operations-survey-2023/Download-data/business-operations-survey-2023-climate-change.csv"
                            , encoding='ISO-8859-1')
data_from_url.head()

,description,industry,level,size,line_code,value,Unit,footnotes
0,Total number of businesses,total,0,619 employees,NaN,35562,Number of businesses,1 and 2 and 3 and 4 and 6
1,Total number of businesses,total,0,2049 employees,NaN,8796,Number of businesses,1 and 2 and 3 and 4 and 6
2,Total number of businesses,total,0,5099 employees,NaN,2529,Number of businesses,1 and 2 and 3 and 4 and 6
3,Total number of businesses,total,0,100+ employees,NaN,2100,Number of businesses,1 and 2 and 3 and 4 and 6
4,Total number of businesses,"Agriculture, forestry, & fishing",1,total,NaN,3756,Number of businesses,1 and 2 and 3 and 6

In [30]:
! pip install chardet requests

Requirement already satisfied: chardet in /home/ravik/src_git/learn_ds/menv/lib/python3.12/site-packages (5.2.0)
Requirement already satisfied: requests in /home/ravik/src_git/learn_ds/menv/lib/python3.12/site-packages (2.32.3)
Requirement already satisfied: charset-normalizer<4,>=2 in /home/ravik/src_git/learn_ds/menv/lib/python3.12/site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /home/ravik/src_git/learn_ds/menv/lib/python3.12/site-packages (from requests) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /home/ravik/src_git/learn_ds/menv/lib/python3.12/site-packages (from requests) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in /home/ravik/src_git/learn_ds/menv/lib/python3.12/site-packages (from requests) (2024.8.30)

In [31]:
# Downloading the same data with some help on the encoding.

import chardet
import requests
import pandas as pd

In [32]:
# Get the content from the URL
url = "https://www.stats.govt.nz/assets/Uploads/Business-operations-survey/Business-operations-survey-2023/Download-data/business-operations-survey-2023-climate-change.csv"
response = requests.get(url=url)

In [33]:
# Detect the encoding
result = chardet.detect(response.content)
result

{'encoding': 'Windows-1252', 'confidence': 0.73, 'language': ''}

In [34]:
# load csv using detected encoding.
encoding = result['encoding']
data_from_url = pd.read_csv(url, encoding=encoding)

In [35]:
# Display first few rows.
data_from_url.head()

,description,industry,level,size,line_code,value,Unit,footnotes
0,Total number of businesses,total,0,6–19 employees,NaN,35562,Number of businesses,1 and 2 and 3 and 4 and 6
1,Total number of businesses,total,0,20–49 employees,NaN,8796,Number of businesses,1 and 2 and 3 and 4 and 6
2,Total number of businesses,total,0,50–99 employees,NaN,2529,Number of businesses,1 and 2 and 3 and 4 and 6
3,Total number of businesses,total,0,100+ employees,NaN,2100,Number of businesses,1 and 2 and 3 and 4 and 6
4,Total number of businesses,"Agriculture, forestry, & fishing",1,total,NaN,3756,Number of businesses,1 and 2 and 3 and 6

#### Describing data of car sales.
###### We will import the date again for sanity

In [36]:
import pandas as pd

In [37]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [38]:
# Atrributes. If we have () at the end it is a function.
# Currently this attribute is returning a metadata of the given df.
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [39]:
car_columns = car_sales.columns.to_list()
car_columns

['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price']

In [40]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [41]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [42]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [43]:
car_sales.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [44]:
# Testing the mean in pandas
car_prices = pd.Series([3000, 4500, 234550])
car_prices.mean()

80683.33333333333

In [45]:
# Query only one column of data
car_sales["Doors"].sum()

40

In [46]:
len(car_sales)

10

### Viewing and selecting data in Pandas

In [49]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [50]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [52]:
# .loc and .iloc
animals = pd.Series(['cat', 'dog', 'bird', 'panda', 'snake'], index=[0, 3, 9, 8,3])
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [54]:
animals.loc[3]  # Depends on index.

3      dog
3    snake
dtype: object

In [55]:
animals.iloc[3]  # Depends on position.

'panda'

In [56]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [57]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [61]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [62]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [63]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [64]:
car_sales.iloc[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [65]:
car_sales.head(3)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [66]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [67]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [68]:
car_sales.Make  # We cannot use this for columns with space in its name. So renaming is wiser during cleaning.

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object